# Setup

In [2]:
import sqlite3
conn = sqlite3.connect("nominations.db")

In [3]:
schema = conn.execute("pragma table_info(nominations)").fetchall()
first_ten = conn.execute("select * from nominations LIMIT 10")
for i in schema:
    print(i)
for i in first_ten:
    print(i)

(0, 'Year', 'INTEGER', 0, None, 0)
(1, 'Category', 'TEXT', 0, None, 0)
(2, 'Nominee', 'TEXT', 0, None, 0)
(3, 'Won', 'INTEGER', 0, None, 0)
(4, 'Movie', 'TEXT', 0, None, 0)
(5, 'Character', 'TEXT', 0, None, 0)
(2010, 'Actor -- Leading Role', 'Javier Bardem', 0, 'Biutiful', 'Uxbal')
(2010, 'Actor -- Leading Role', 'Jeff Bridges', 0, 'True Grit', 'Rooster Cogburn')
(2010, 'Actor -- Leading Role', 'Jesse Eisenberg', 0, 'The Social Network', 'Mark Zuckerberg')
(2010, 'Actor -- Leading Role', 'Colin Firth', 1, "The King's Speech", 'King George VI')
(2010, 'Actor -- Leading Role', 'James Franco', 0, '127 Hours', 'Aron Ralston')
(2010, 'Actor -- Supporting Role', 'Christian Bale', 1, 'The Fighter', 'Dicky Eklund')
(2010, 'Actor -- Supporting Role', 'John Hawkes', 0, "Winter's Bone", 'Teardrop')
(2010, 'Actor -- Supporting Role', 'Jeremy Renner', 0, 'The Town', 'James Coughlin')
(2010, 'Actor -- Supporting Role', 'Mark Ruffalo', 0, 'The Kids Are All Right', 'Paul')
(2010, 'Actor -- Supporting Role', 'Geoffrey Rush', 0, "The King's Speech", 'Lionel Logue')

# Creating The Ceremonies Table

In [5]:
create_query = "CREATE TABLE ceremonies(id INTEGER, Year INTEGER, Host TEXT, PRIMARY KEY(id));"
conn.execute(create_query)

years_hosts = [(2010, "Steve Martin"),
               (2009, "Hugh Jackman"),
               (2008, "Jon Stewart"),
               (2007, "Ellen DeGeneres"),
               (2006, "Jon Stewart"),
               (2005, "Chris Rock"),
               (2004, "Billy Crystal"),
               (2003, "Steve Martin"),
               (2002, "Whoopi Goldberg"),
               (2001, "Steve Martin"),
               (2000, "Billy Crystal"),
            ]
insert_query = "INSERT INTO ceremonies (Year, Host) VALUES (?,?)"
conn.executemany(insert_query,years_hosts)

schema = conn.execute("pragma table_info(ceremonies);").fetchall()
first_ten = conn.execute("select * from ceremonies;")
for i in schema:
    print(i)
for i in first_ten:
    print(i)

(0, 'id', 'INTEGER', 0, None, 1)
(1, 'Year', 'INTEGER', 0, None, 0)
(2, 'Host', 'TEXT', 0, None, 0)
(1, 2010, 'Steve Martin')
(2, 2009, 'Hugh Jackman')
(3, 2008, 'Jon Stewart')
(4, 2007, 'Ellen DeGeneres')
(5, 2006, 'Jon Stewart')
(6, 2005, 'Chris Rock')
(7, 2004, 'Billy Crystal')
(8, 2003, 'Steve Martin')
(9, 2002, 'Whoopi Goldberg')
(10, 2001, 'Steve Martin')
(11, 2000, 'Billy Crystal')

# Foreign Key Constraits

In [6]:
conn.execute("PRAGMA foreign_keys = ON")

# Setting Up One-To-Many

In [7]:
create_nominations_two = "CREATE TABLE nominations_two(id INTEGER PRIMARY KEY, category TEXT, nominee TEXT, movie TEXT, character TEXT, won INTEGER, ceremony_id INTEGER, FOREIGN KEY(ceremony_id) REFERENCES ceremonies(id));"
conn.execute(create_nominations_two)

joined_nominations = conn.execute("SELECT ceremonies.id as ceremony_id, nominations.category as category, nominations.nominee as nominee, nominations.movie as movie, nominations.character as character, nominations.won as won FROM nominations INNER JOIN ceremonies ON nominations.year == ceremonies.year;").fetchall()
insert_nominations_two = "INSERT INTO nominations_two (ceremony_id,category,nominee,movie,character,won) VALUES (?,?,?,?,?,?);"
conn.executemany(insert_nominations_two,joined_nominations)

for i in conn.execute("SELECT * FROM nominations_two LIMIT 5;").fetchall():
    print(i)

(1, 'Actor -- Leading Role', 'Javier Bardem', 'Biutiful', 'Uxbal', 0, 1)
(2, 'Actor -- Leading Role', 'Jeff Bridges', 'True Grit', 'Rooster Cogburn', 0, 1)
(3, 'Actor -- Leading Role', 'Jesse Eisenberg', 'The Social Network', 'Mark Zuckerberg', 0, 1)
(4, 'Actor -- Leading Role', 'Colin Firth', "The King's Speech", 'King George VI', 1, 1)
(5, 'Actor -- Leading Role', 'James Franco', '127 Hours', 'Aron Ralston', 0, 1)

# Delete and Rename

In [8]:
conn.execute("DROP TABLE nominations;")
conn.execute("ALTER TABLE nominations_two RENAME TO nominations")

# Creating a Join Table

In [16]:
conn.execute("CREATE TABLE movies(id INTEGER PRIMARY KEY, movie TEXT)")
conn.execute("CREATE TABLE actors(id INTEGER PRIMARY KEY, actor TEXT)")
conn.execute("CREATE TABLE movies_actors(id INTEGER PRIMARY KEY, movie_id INTEGER, actor_id INTEGER, FOREIGN KEY(movie_id) REFERENCES movies(id), FOREIGN KEY(actor_id) REFERENCES actors(id))")

# Exploration

##### What other datasets can we add to the database?

A table for characters would not be helpful since they are fairly unique to each nomination. If we were working with the larger set of nominations (more than just actors), we would add in more tables to represent the Additional Info for these categories.

##### Based on what you know, brainstorm how you would populate the join table and the linked tables using data from nominations.

First we would query nominations to pull out all distint movies and actors and assign these to their respective tables. Then we would write a query that joins nominations to both movies and actors to get the movie_id and actor_id information into a list of tuples to be inserted into the join table as we did in the project.

In [17]:
insert_movies = "INSERT INTO movies (movie) SELECT DISTINCT movie FROM nominations;"
insert_actors = "INSERT INTO actors (actor) SELECT DISTINCT nominee FROM nominations;"
conn.execute(insert_movies)
conn.execute(insert_actors)

print(conn.execute("SELECT * FROM movies LIMIT 5;").fetchall())
print(conn.execute("SELECT * FROM actors LIMIT 5;").fetchall())

[(1, 'Biutiful'), (2, 'True Grit'), (3, 'The Social Network'), (4, "The King's Speech"), (5, '127 Hours')]
[(1, 'Javier Bardem'), (2, 'Jeff Bridges'), (3, 'Jesse Eisenberg'), (4, 'Colin Firth'), (5, 'James Franco')]

In [19]:
join_query = "SELECT movies.id as movie_id, actors.id as actor_id FROM nominations INNER JOIN movies ON nominations.movie == movies.movie INNER JOIN actors ON  nominations.nominee == actors.actor;"
join_info = conn.execute(join_query).fetchall()
insert_joins = "INSERT INTO movies_actors (movie_id,actor_id) VALUES (?,?)"
conn.executemany(insert_joins,join_info)
print(conn.execute("select * from movies_actors limit 5;").fetchall())
print(conn.execute("select * from movies_actors INNER JOIN movies on movies_actors.movie_id == movies.id INNER JOIN actors on movies_actors.actor_id == actors.id LIMIT 20;").fetchall())

[(1, 1, 1), (2, 2, 2), (3, 3, 3), (4, 4, 4), (5, 5, 5)]
[(1, 1, 1, 1, 'Biutiful', 1, 'Javier Bardem'), (2, 2, 2, 2, 'True Grit', 2, 'Jeff Bridges'), (3, 3, 3, 3, 'The Social Network', 3, 'Jesse Eisenberg'), (4, 4, 4, 4, "The King's Speech", 4, 'Colin Firth'), (5, 5, 5, 5, '127 Hours', 5, 'James Franco'), (6, 6, 6, 6, 'The Fighter', 6, 'Christian Bale'), (7, 7, 7, 7, "Winter's Bone", 7, 'John Hawkes'), (8, 8, 8, 8, 'The Town', 8, 'Jeremy Renner'), (9, 9, 9, 9, 'The Kids Are All Right', 9, 'Mark Ruffalo'), (10, 4, 10, 4, "The King's Speech", 10, 'Geoffrey Rush'), (11, 9, 11, 9, 'The Kids Are All Right', 11, 'Annette Bening'), (12, 10, 12, 10, 'Rabbit Hole', 12, 'Nicole Kidman'), (13, 7, 13, 7, "Winter's Bone", 13, 'Jennifer Lawrence'), (14, 11, 14, 11, 'Black Swan', 14, 'Natalie Portman'), (15, 12, 15, 12, 'Blue Valentine', 15, 'Michelle Williams'), (16, 6, 16, 6, 'The Fighter', 16, 'Amy Adams'), (17, 4, 17, 4, "The King's Speech", 17, 'Helena Bonham Carter'), (18, 6, 18, 6, 'The Fighter', 18, 'Melissa Leo'), (19, 2, 19, 2, 'True Grit', 19, 'Hailee Steinfeld'), (20, 13, 20, 13, 'Animal Kingdom', 20, 'Jacki Weaver')]